local S, C, L, DB = unpack(select(2, ...))

if GetLocale() ~= "zhCN" then  return end
-- 控制台
--标语
L["恢复默认标语"] = "|cffDDA0DDSun|r|cff44CCFFUI|r\n|cffFFD700确认恢复默认设置|r\n"
L["欢迎标语"] = "欢迎使用|cffDDA0DDSun|r|cff44CCFFUI|r\n\n请点击确定按钮加载默认配置\n"
L["警告"] = "|cffDDA0DDSun|r|cff44CCFFUI|r\n|cffFFD700开启此功能会导致战斗中内存暴涨,请量力开启.|r"
--总
L["恢复默认设置"] = "恢复默认设置"
L["解锁框体"] = "解锁框体"
L["锁定框体"] = "锁定框体"
L["应用(重载界面)"] = "应用(重载界面)"
-- 动作条
L["动作条"] = "动作条"
L["请选择主动作条布局"] = "请选择主动作条布局"
L["bar1布局"] = "bar1布局"
L["bar2布局"] = "bar2布局"
L["bar3布局"] = "bar3布局"
L["bar4布局"] = "bar4布局"
L["bar5布局"] = "bar5布局"
L["12x1布局"] = "12x1布局"
L["6x2布局"] = "6x2布局"
L["4方块布局"] = "4方块布局"
L["不要4方块布局"] = "不要4方块布局"
L["动作条皮肤风格"] = "动作条皮肤风格"
L["请选择动作条皮肤风格"] = "请选择动作条皮肤风格"
L["阴影风格"] = "阴影风格"
L["框框风格"] = "框框风格"
L["隐藏快捷键显示"] = "隐藏快捷键显示"
L["隐藏宏名称显示"] = "隐藏宏名称显示"
L["冷却闪光"] = "冷却闪光"
L["动作条按钮大小"] = "动作条按钮大小"
L["动作条间距大小"] = "动作条间距大小"
L["动作条字体大小"] = "动作条字体大小"
L["宏名字字体大小"] = "宏名字字体大小"
L["主动作条缩放大小"] = "主动作条缩放大小"
L["特殊按钮缩放大小"] = "特殊按钮缩放大小"
L["宠物条缩放大小"] = "宠物条缩放大小"
L["姿态栏缩放大小"] = "姿态栏缩放大小"
L["图腾栏缩放大小"] = "图腾栏缩放大小"
L["冷却闪光图标大小"] = "冷却闪光图标大小"
--姓名板
L["姓名板"] = "姓名板"
L["姓名板字体大小"] = "姓名板字体大小"
L["姓名板血条高度"] = "姓名板血条高度"
L["姓名板血条宽度"] = "姓名板血条宽度"
L["姓名板施法条图标大小"] = "姓名板施法条图标大小"
L["姓名板施法条高度"] = "姓名板施法条高度"
L["姓名板施法条宽度"] = "姓名板施法条宽度"
L["启用姓名板"] = "启用姓名板"
L["启用战斗显示"] = "启用战斗显示"
L["启用debuff显示"] = "启用debuff显示"

--鼠标提示
L["鼠标提示"] = "鼠标提示"
L["提示框体跟随鼠标"] = "提示框体跟随鼠标"
L["进入战斗自动隐藏"] = "进入战斗自动隐藏"
L["字体大小"] = "字体大小"
L["隐藏头衔"] = "隐藏头衔"
L["主天赋"] = "主天赋:|cffffffff "
L["副天赋"] = "副天赋:|cffffffff "
L["成就点数"] = "|cFFF1C502成就点数:  |cFFFFFFFF"
L["正在查询成就"] = "正在查询成就.."
L["释放者"] = "释放者:"
L["法术ID"] = "法术编号"
--增益效果
L["增益效果"] = "增益效果"
L["图标大小"] = "图标大小："
L["BUFF增长方向"] = "BUFF增长方向："
L["从右向左"] = "从右向左"
L["从左向右"] = "从左向右"
L["DEBUFF增长方向"] = "DEBUFF增长方向："
L["每行图标数"] = "每行图标数"
--仇恨监视
L["仇恨监视"] = "仇恨监视"
L["仇恨条宽度"] = "仇恨条宽度："
L["仇恨条姓名长度"] = "仇恨条姓名长度："
L["显示仇恨人数"] = "显示仇恨人数(不包括Tank)："
--reminder
L["缺失提醒"] = "缺失提醒"
L["显示团队增益缺失提醒"] = "显示团队增益缺失提醒"
L["只在队伍中显示"] = "只在队伍中显示"
L["团队增益图标大小"] = "团队增益图标大小："
L["团队增益图标排列方式"] = "团队增益图标排列方式："
L["横排"] = "横排"
L["竖排"] = "竖排"
L["显示职业增益缺失提醒"] = "显示职业增益缺失提醒"
L["开启声音警报"] = "开启声音警报"
L["职业增益图标大小"] = "职业增益图标大小："
L["职业增益图标间距"] = "职业增益图标间距："
--界面皮肤
L["界面皮肤"] = "界面皮肤"
L["启用DBM皮肤"] = "启用DBM皮肤"
--头像
L["头像框体"] = "头像框体"
L["开启boss框体"] = "开启boss框体"
L["血条职业颜色"] = "血条职业颜色"
L["蓝条颜色"] = "蓝条颜色"
L["蓝条职业颜色"] = "蓝条职业颜色"
L["是否开启头像"] = "是否开启头像"
L["是否只显示你释放的debuff"] = "是否只显示妳释放的debuff"
L["头像字体大小"] = "头像字体大小："
L["法力条高度"] = "法力条高度："
L["头像缩放大小"] = "头像缩放大小："
L["玩家施法条宽度"] = "玩家施法条宽度："
L["玩家施法条高度"] = "玩家施法条高度："
L["目标施法条宽度"] = "目标施法条宽度："
L["目标施法条高度"] = "目标施法条高度："
L["焦点施法条宽度"] = "焦点施法条宽度："
L["焦点施法条高度"] = "焦点施法条高度："
L["宠物施法条宽度"] = "宠物施法条宽度："
L["宠物施法条高度"] = "宠物施法条高度："
L["施法条图标大小"] = "施法条图标大小："
--mini
L["小东西设置"] = "小东西设置"
L["启用出售垃圾"] = "启用出售垃圾"
L["启用自动修理"] = "启用自动修理"
L["启用聊天信息过滤"] = "启用聊天信息过滤"
L["启用系统红字屏蔽"] = "启用系统红字屏蔽"
L["启用打断通报"] = "启用打断通报"
L["PVP冷却计时"] = "PVP冷却计时"
L["启用团队工具"] = "启用团队工具"
L["需要团长或者助理权限"] = "需要团长或者助理权限"
L["启用自动邀请"] = "启用自动邀请"
L["自动邀请关键字"] = "自动邀请关键字："
L["启用自动离开有进度的随机副本或团队"] = "启用自动离开有进度的随机副本或团队"
L["UI缩放"] = "UI缩放"
L["UI缩放大小"] = "UI缩放大小："
L["应用"] = "应用"
L["启用插件UI缩放设定"] = "启用插件UI缩放设定"
L["自动设定UI缩放"] = "自动设定UI缩放"
L["需要开启插件UI缩放设定"] = "需要开启插件UI缩放设定"
L["锁定UI缩放"] = "锁定UI缩放"
L["内置CD"] = "内置CD"
L["启动内置CD"] = "启动内置CD"
L["内置CD字体大小"] = "内置CD字体大小："
L["框体宽度"] = "框体宽度："
L["框体高度"] = "框体高度："
L["计时条增长方向"] = "计时条增长方向："
L["向下"] = "向下"
L["向上"] = "向上"
L["启用施法通告"] = "启用施法通告"
--other
L["内存占用"] = "|cffFFD700内存占用：|r"
L["处理器占用"] = "|cffFFD700处理器占用：|r"
L["插件管理"] = "|cffDDA0DD插件管理|r"
L["SunUI插件管理"] = "|cffDDA0DDSun|r|cff44CCFFUI|r插件管理"
L["第"] = "第 "
L["页/共"] = " 页 / 共 "
L["页"] = " 页"
--打断
L["我已打断: =>"] = "我已断法: =>"
L["<=的 "] = "<=的 "
--背包
L["背包"] = "背包"
L["搜索"] = "搜索"
L["整理背包"] = "整理背包"
--move
L["玩家施法条"] = "玩家施法条"
L["目标施法条"] = "目标施法条"
L["焦点施法条"] = "焦点施法条"
L["宠物施法条"] = "宠物施法条"
L["内置CD监视"] = "内置CD监视"
L["仇恨监视"] = "仇恨监视"
L["缺少药剂buff提示"] = "缺少药剂buff提示"
L["连击点"] = "连击点"
L["暗影魔计时条"] = "暗影魔计时条"
L["小地图"] = "小地图"
L["鼠标左键拖动我!"] = "鼠标左键拖动我!"
L["药水"] = "精炼"
L["冷却闪光"] = "冷却闪光"
--minimap
L["角色信息"] = "角色信息"
L["法术书"] = "法术书"
L["天赋"] = "天赋"
L["成就"] = "成就"
L["任务日志"] = "任务日志"
L["社交"] = "社交"
L["公会"] = "公会"
L["地城查找器"] = "地城查找器"
L["团队查找器"] = "团队查找器"
L["帮助"] = "帮助"
L["行事历"] = "行事历"
L["地城手册"] = "地城手册"
L["就位确认"] = "就位确认"
L["角色检查"] = "角色检查"
L["转化为团队"] = "转化为团队"
L["转化为小队"] = "转化为小队"
--声望条
L["经验值"] = "经验值:"
L["剩余"] = '剩馀: %s'
L["休息"] = '|cffb3e1ff休息: %s (%d%%)'
L["阵营"] = '阵营: %s'
L["状态"] = '状态: |c'
L["声望"] = '声望: %s/%s (%d%%)'
L["仇恨"] = "仇恨"
L["敌对"] = "敌对"
L["不友好"] = "不友好"
L["中立"] = "中立"
L["友好"] = "友好"
L["尊敬"] = "尊敬"
L["崇敬"] = "崇敬"
L["崇拜"] = "崇拜"
--信息条
L["没有工会"] = "没有工会"
L["免伤分析"] = "免伤分析"
L["免伤"] = "免伤"
L["等级缓和"] = "等级缓和"
L["头部"] = "头部"
L["肩部"] = "肩部"
L["胸部"] = "胸部"
L["腰部"] = "腰部"
L["手腕"] = "手腕"
L["手"] = "手"
L["腿部"] = "腿部"
L["脚"] = "脚"
L["主手"] = "主手"
L["副手"] = "副手"
L["远程"] = "远程"
L["共释放内存"] = "共释放内存"
L["总共内存使用"] = "总共内存使用"
L["延迟"] = "延迟"
L["本地延迟"] = "本地延迟"
L["世界延迟"] = "世界延迟"
L["耐久度"] = "耐久度"
L["信息面板"] = "信息面板"
L["启用顶部信息条"] = "启用顶部信息条"
L["启用底部信息条"] = "启用底部信息条"
L["底部信息条宽度"] = "底部信息条宽度"
L["底部信息条高度"] = "底部信息条高度"
L["带宽"] = "带宽"
L["下载"] = "下载"
L["背包"] = "背包"
L["背包剩余"] = "背包剩余"
L["背包总计"] = "背包总计"
L["邮件"] = "邮件"
L["新邮件"] = "新邮件"
L["无邮件"] = "无邮件"
L["地区"] = "地区"
L["Hidden"] = "隐藏"
L["Alt"] = "Alt展开"
L["Default UI Memory Usage:"] = "暴雪插件资源耗用:"
L["Total Memory Usage:"] = "总资源耗用:"
--聊天
L["综合"] = "综合"
L["交易"] = "交易"
L["世界防务"] = "世界防务"
L["本地防御"] = "本地防御"
L["寻求组队"] = "寻求组队"
L["工会招募"] = "工会招募"
L["战场"] = "战场"
L["战场领袖"] = "战场领袖"
L["工会"] = "工会"
L["小队"] = "小队"
L["小队队长"] = "小队队长"
L["地城领袖"] = "地城领袖"
L["官员"] = "官员"
L["团队"] = "团队"
L["团队领袖"] = "团队领袖"
L["团队警告"] = "团队警告"
--staddonmanage
L["Search"] = "搜索"
L["ReloadUI"] = "重载介面"
L["Profiles"] = "配置文件"
L["New_Profile"] = "新配置文件"
L["Enable_All"] = "全部开启"
L["Disable_All"] = "全部关闭"
L["Profile_Name"] = "配置文件名字"
L["Set_To"] = "设置"
L["Add_To"] = "应用"
L["Remove_From"] = "撤销"
L["Delete_Profile"] = "删除"
L["Confirm_Delete"] = "您确定要删除这个配置麽? 确定请按住shift点击删除按钮"
L["Dependencies"] = "依赖于:"
L["Optional Dependencies"] = "可选依赖于:"
L["全局字体大小"] = "全局字体大小系数"
--channel
L["大脚世界频道"] = "大脚世界频道"
L["离开大脚频道"] = "|cffFFD700离开大脚频道|r"
L["加入大脚世界频道"] = "|cffFFD700加入大脚世界频道|r"
L["关闭"] = "|cffFF0000关闭|r"
L["开启"] = "|cff228B22开启|r"
L["大脚世界频道开关"] = "大脚世界频道开关"
L["点击进入或者离开"] = "点击|cff228B22进入|r或者|cffFF0000离开|r"
L["您现在大脚世界频道处于"] = "您现在大脚世界频道处于"
L["状态"] = "状态"
--3.6
L["一次显示插件数目"] = "一次显示插件数目"
L["动作条渐隐"] = "动作条渐隐"
L["隐藏团队警告"] = "隐藏团队警告"
L["玩家与目标框体宽度"] = "玩家与目标框体宽度"
L["玩家与目标框体高度"] = "玩家与目标框体高度"
L["宠物ToT焦点框体宽度"] = "宠物ToT焦点框体宽度"
L["宠物ToT焦点框体高度"] = "宠物ToT焦点框体高度"
L["宠物ToT焦点缩放大小"] = "宠物ToT焦点缩放大小"
L["Boss小队竞技场框体宽度"] = "Boss小队竞技场框体宽度"
L["Boss小队竞技场框体高度"] = "Boss小队竞技场框体高度"
L["Boss小队竞技场缩放大小"] = "Boss小队竞技场缩放大小"
L["开启目标的目标"] = "开启目标的目标"
L["开启宠物框体"] = "开启宠物框体"
L["开启焦点框体"] = "开启焦点框体"
L["开启小队框体"] = "开启小队框体"
L["开启boss框体"] = "开启boss框体"
L["开启竞技场框体"] = "开启竞技场框体"
L["开启物理攻击计时条"] = "开启物理攻击计时条"
L["开启头像渐隐"] = "开启头像渐隐"
L["开启头像职业血条颜色"] = "开启头像职业血条颜色"
L["锁定玩家施法条到玩家头像"] = "锁定玩家施法条到玩家头像"
L["锁定目标施法条到目标框体"] = "锁定目标施法条到目标框体"
L["锁定焦点施法条到焦点框体"] = "锁定焦点施法条到焦点框体"
L["头像透明度"] = "头像透明度"
--320
L["目标增减益"] = "目标增减益"
L["显示"] = "显示"
L["不显示"] = "不显示"
--422
L["团队框架"] = "团队框架"
L["技能监视"] = "技能监视"
--503
L["打开任务物品按钮"] = "任务物品按钮"
L["打开自动补购"] = "打开自动补购"
L["打开坦克护盾监视"] = "坦克护盾监视"
L["打开团队技能CD监视"] = "团队技能CD监视"
--519
L["传送符文"] = "传送符文"
L["传送门符文"] = "传送门符文"
L["魔粉"] = "魔粉"
L["速效药膏"] = "速效药膏"
L["致命药膏"] = "致命药膏"
L["减速药膏"] = "减速药膏"
L["麻痹药膏"] = "麻痹药膏"
L["致伤药膏"]= "致伤药膏"

--new
-- Talent spec
L_PLANNER_DEATHKNIGHT_1 = "鲜血"
L_PLANNER_DEATHKNIGHT_2 = "冰霜"
L_PLANNER_DEATHKNIGHT_3 = "邪恶"
L_PLANNER_DRUID_1 = "平衡"
L_PLANNER_DRUID_2 = "野性战斗"
L_PLANNER_DRUID_3 = "Guardian" -- need review
L_PLANNER_DRUID_4 = "恢复"
L_PLANNER_HUNTER_1 = "野兽掌握"
L_PLANNER_HUNTER_2 = "射击"
L_PLANNER_HUNTER_3 = "生存"
L_PLANNER_MAGE_1 = "奥术"
L_PLANNER_MAGE_2 = "火焰"
L_PLANNER_MAGE_3 = "冰霜"
L_PLANNER_MONK_1 = "酒仙" -- need review
L_PLANNER_MONK_2 = "织物" -- need review
L_PLANNER_MONK_3 = "踏风" -- need review
L_PLANNER_PALADIN_1 = "神圣"
L_PLANNER_PALADIN_2 = "防护"
L_PLANNER_PALADIN_3 = "惩戒"
L_PLANNER_PRIEST_1 = "戒律"
L_PLANNER_PRIEST_2 = "神圣"
L_PLANNER_PRIEST_3 = "暗影"
L_PLANNER_ROGUE_1 = "刺杀"
L_PLANNER_ROGUE_2 = "战斗"
L_PLANNER_ROGUE_3 = "敏锐"
L_PLANNER_SHAMAN_1 = "元素战斗"
L_PLANNER_SHAMAN_2 = "增强"
L_PLANNER_SHAMAN_3 = "恢复"
L_PLANNER_WARLOCK_1 = "痛苦"
L_PLANNER_WARLOCK_2 = "恶魔学识"
L_PLANNER_WARLOCK_3 = "毁灭"
L_PLANNER_WARRIOR_1 = "武器"
L_PLANNER_WARRIOR_2 = "狂怒"
L_PLANNER_WARRIOR_3 = "防护"

L_PANELS_AFK = "你处于暂离状态!"
L_PANELS_AFK_RCLICK = "右键点击隐藏."
L_PANELS_AFK_LCLICK = "左键点击返回."

-- Tooltip
L_TOOLTIP_NO_TALENT = "没有天赋"
L_TOOLTIP_LOADING = "读取中..."
L_TOOLTIP_ACH_STATUS = "你的状态:"
L_TOOLTIP_ACH_COMPLETE = "你的状态: 完成 "
L_TOOLTIP_ACH_INCOMPLETE = "你的状态: 未完成"
L_TOOLTIP_SPELL_ID = "法术ID:"
L_TOOLTIP_ITEM_ID = "物品ID:"
L_TOOLTIP_WHO_TARGET = "以其为目标的"
L_TOOLTIP_ITEM_COUNT = "物品数量: "
L_TOOLTIP_INSPECT_OPEN = "Inspect Frame is open" -- Needs review
--Loot
L_LOOT_CANNOT = "不能拾取"
--map
L_ZONE_WINTERGRASP = "冬握湖"
L_ZONE_TOLBARAD = "托尔巴拉德"
L_ZONE_TOLBARADPEN = "托尔巴拉德半岛"
L_ZONE_ARATHIBASIN = "阿拉希盆地"
L_ZONE_GILNEAS = "吉尔尼斯之战"
-- ExploreMap
L_EXTRA_EXPLORED = "探索: " -- Needs review
L_EXTRA_ZONEACHID = {
	-- http://www.wowhead.com/achievement=*
	-- e(X)plore achievement id, (Q)uest achievement id
	["东部王国"]							= {X =   42, A =    0, H =    0},
	["卡利姆多"]							= {X =   43, A =    0, H =    0},
	["外域"]							= {X =   44, A =    0, H =    0},
	["诺森德"]							= {X =   45, A =    0, H =    0},
	["世界地图"]							= {X =  nil, A =    0, H =    0},
	["Pandaria"]						= {X = 6974, A =    0, H =    0}, -- Needs review
	-- Eastern Kingdoms
	["阿拉希高地"]						= {X =  761, A = 4896, H = 4896},
	["荒芜之地"]							= {X =  765, A = 4900, H = 4900},
	["诅咒之地"]							= {X =  766, A = 4909, H = 4909},
	["燃烧平原"]							= {X =  775, A = 4901, H = 4901},
	["逆风小径"]							= {X =  777, A =    0, H =    0},
	["丹莫罗"]							= {X =  627, A =    0, H =    0},
	["暮色森林"]							= {X =  778, A = 4903, H =    0},
	["东瘟疫之地"]						= {X =  771, A = 4892, H = 4892},
	["艾尔文森林"]						= {X =  776, A =    0, H =    0},
	["永歌森林"]							= {X =  859, A =    0, H =    0},
	["幽魂之地"]							= {X =  858, A =    0, H = 4908},
	["希尔斯布莱德丘陵"]					= {X =  772, A =    0, H = 4895},
	["洛克莫丹"]							= {X =  779, A = 4899, H =    0},
	["北荆棘谷"]							= {X =  781, A = 4906, H = 4906},
	["赤脊山"]							= {X =  780, A = 4902, H =    0},
	["灼热峡谷"]							= {X =  774, A = 4910, H = 4910},
	["银松森林"]							= {X =  769, A =    0, H = 4894},
	["悲伤沼泽"]							= {X =  782, A = 4904, H = 4904},
	["荆棘谷海角"]						= {X = 4995, A = 4905, H = 4905},
	["辛特兰"]							= {X =  773, A = 4897, H = 4897},
	["提瑞斯法林地"]						= {X =  768, A =    0, H =    0},
	["西瘟疫之地"]						= {X =  770, A = 4893, H = 4893},
	["西部荒野"]							= {X =  802, A = 4903, H =    0},
	["湿地"]							= {X =  841, A = 4899, H =    0},
	-- Kalimdor
	["灰谷"]							= {X =  845, A = 4925, H = 4976},
	["艾萨拉"]							= {X =  852, A =    0, H = 4927},
	["秘蓝岛"]							= {X =  860, A =    0, H =    0},
	["秘血岛"]							= {X =  861, A = 4926, H = 4926},
	["黑海岸"]							= {X =  844, A = 4928, H = 4928},
	["凄凉之地"]							= {X =  848, A = 4930, H = 4930},
	["杜隆塔尔"]							= {X =  728, A =    0, H =    0},
	["尘泥沼泽"]							= {X =  850, A = 4929, H = 4978},
	["费伍德森林"]						= {X =  853, A = 4931, H = 4931},
	["菲拉斯"]							= {X =  849, A = 4932, H = 4979},
	["月光林地"]							= {X =  855, A =    0, H =    0},
	["莫高雷"]							= {X =  736, A =    0, H =    0},
	["北贫瘠之地"]						= {X =  750, A =    0, H = 4933},
	["希利苏斯"]							= {X =  856, A = 4934, H = 4934},
	["南贫瘠之地"]						= {X = 4996, A = 4937, H = 4981},
	["石爪山脉"]							= {X =  847, A = 4936, H = 4980},
	["塔纳利斯"]							= {X =  851, A = 4935, H = 4935},
	["泰达希尔"]							= {X =  842, A =    0, H =    0},
	["千针石林"]							= {X =  846, A = 4938, H = 4938},
	["安戈洛环形山"]						= {X =  854, A = 4939, H = 4939},
	["冬泉谷"]							= {X =  857, A = 4940, H = 4940},
	-- Outland
	["刀锋山"]							= {X =  865, A = 1193, H = 1193},
	["地狱火半岛"]						= {X =  862, A = 1189, H = 1271},
	["纳格兰"]							= {X =  866, A = 1192, H = 1273},
	["虚空风暴"]							= {X =  843, A = 1194, H = 1194},
	["影月谷"]							= {X =  864, A = 1195, H = 1195},
	["泰罗卡森林"]						= {X =  867, A = 1191, H = 1272},
	["赞加沼泽"]							= {X =  863, A = 1190, H = 1190},
	-- Northrend
	["北风苔原"]							= {X = 1264, A =   33, H = 1358},
	["晶歌森林"]							= {X = 1457, A =    0, H =    0},
	["龙骨荒野"]							= {X = 1265, A =   35, H = 1356},
	["灰熊丘陵"]							= {X = 1266, A =   37, H = 1357},
	["嚎风峡湾"]							= {X = 1263, A =   34, H = 1356},
	["冰冠冰川"]							= {X = 1270, A =   40, H =   40},
	["索拉查盆地"]						= {X = 1268, A =   39, H =   39},
	["风暴峭壁"]							= {X = 1269, A =   38, H =   38},
	["祖达克"]							= {X = 1267, A =   36, H =   36},
	-- Cataclysm
	["深岩之洲"]							= {X = 4864, A = 4871, H = 4871},
	["海加尔"]							= {X = 4863, A = 4870, H = 4870},
	["暮光高地"]							= {X = 4866, A = 4873, H = 5501},
	["奥丹姆"]							= {X = 4865, A = 4872, H = 4872},
	["瓦丝琪尔"]							= {X = 4825, A = 4869, H = 4982},
	["托尔巴拉德"]						= {X =    0, A = 4874, H = 4874},
	["托尔巴拉德半岛"]					= {X =    0, A = 4874, H = 4874},
	-- Pandaria
	["The Jade Forest"]					= {X = 6351, A = 6300, H = 6534}, -- Needs review
	["Valley of the Four Winds"]		= {X = 6969, A = 6301, H = 6301}, -- Needs review
	--["Krasarang Wilds"]					= {X = 6975, A = 6535, H = 6536}, -- Needs review
	["Kun-Lai Summit"]					= {X = 6976, A = 6537, H = 6538}, -- Needs review
	["Townlong Steppes"]				= {X = 6977, A = 6539, H = 6539}, -- Needs review
	["Dread Wastes"]					= {X = 6978, A = 6540, H = 6540}, -- Needs review
	["Vale of Eternal Blossoms"]		= {X = 6979, A =    0, H =    0}, -- Needs review
	-- Boolean Explores
	["奎尔丹纳斯岛"]						= {X =  868, A =    0, H =    0},
	["安其拉：堕落王国"]					= {X =    0, A =    0, H =    0},
	["冬拥湖"]							= {X =    0, A =    0, H =    0},
}
L_MISC_UI_OUTDATED = "SunUI 版本已过期，请至 https://github.com/Coolkids/SunUI 下载最新版"